Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcumap_stm32f0x.h
#define DIO158_GPIO DIN28_GPIO
#endif
#if (defined(DIN29_PORT) && defined(DIN29_BIT))
#define DIN29 159
#define DIN29_AHBEN (__rccgpioen__(DIN29_PORT))
#define DIN29_GPIO (__gpio__(DIN29_PORT))
#define DIO159 159
#define DIO159_PORT DIN29_PORT
#define DIO159_BIT DIN29_BIT
#define DIO159_AHBEN DIN29_AHBEN
#define DIO159_GPIO DIN29_GPIO
#endif
#if (defined(DIN30_PORT) && defined(DIN30_BIT))
#define DIN30 160
#define DIN30_AHBEN (__rccgpioen__(DIN30_PORT))
#define DIN30_GPIO (__gpio__(DIN30_PORT))
#define DIO160 160
#define DIO160_PORT DIN30_PORT
#define DIO160_BIT DIN30_BIT
#define DIO160_AHBEN DIN30_AHBEN
#define DIO160_GPIO DIN30_GPIO
#endif
#if (defined(DIN31_PORT) && defined(DIN31_BIT))
#define DIN31 161
#define DIN31_AHBEN (__rccgpioen__(DIN31_PORT))
#define DIN31_GPIO (__gpio__(DIN31_PORT))
#define DIO161 161
#define DIO161_PORT DIN31_PORT
#define DIO161_BIT DIN31_BIT
#define DIO161_AHBEN DIN31_AHBEN
#define DIO161_GPIO DIN31_GPIO
#endif
#if (defined(DIN32_PORT) && defined(DIN32_BIT))
#define DIN32 162
#define DIN32_AHBEN (__rccgpioen__(DIN32_PORT))
#define DIN32_GPIO (__gpio__(DIN32_PORT))
#define DIO162 162
#define DIO162_PORT DIN32_PORT
#define DIO162_BIT DIN32_BIT
#define DIO162_AHBEN DIN32_AHBEN
#define DIO162_GPIO DIN32_GPIO
#endif
#if (defined(DIN33_PORT) && defined(DIN33_BIT))
#define DIN33 163
#define DIN33_AHBEN (__rccgpioen__(DIN33_PORT))
#define DIN33_GPIO (__gpio__(DIN33_PORT))
#define DIO163 163
#define DIO163_PORT DIN33_PORT
#define DIO163_BIT DIN33_BIT
#define DIO163_AHBEN DIN33_AHBEN
#define DIO163_GPIO DIN33_GPIO
#endif
#if (defined(DIN34_PORT) && defined(DIN34_BIT))
#define DIN34 164
#define DIN34_AHBEN (__rccgpioen__(DIN34_PORT))
#define DIN34_GPIO (__gpio__(DIN34_PORT))
#define DIO164 164
#define DIO164_PORT DIN34_PORT
#define DIO164_BIT DIN34_BIT
#define DIO164_AHBEN DIN34_AHBEN
#define DIO164_GPIO DIN34_GPIO
#endif
#if (defined(DIN35_PORT) && defined(DIN35_BIT))
#define DIN35 165
#define DIN35_AHBEN (__rccgpioen__(DIN35_PORT))
#define DIN35_GPIO (__gpio__(DIN35_PORT))
#define DIO165 165
#define DIO165_PORT DIN35_PORT
#define DIO165_BIT DIN35_BIT
#define DIO165_AHBEN DIN35_AHBEN
#define DIO165_GPIO DIN35_GPIO
#endif
#if (defined(DIN36_PORT) && defined(DIN36_BIT))
#define DIN36 166
#define DIN36_AHBEN (__rccgpioen__(DIN36_PORT))
#define DIN36_GPIO (__gpio__(DIN36_PORT))
#define DIO166 166
#define DIO166_PORT DIN36_PORT
#define DIO166_BIT DIN36_BIT
#define DIO166_AHBEN DIN36_AHBEN
#define DIO166_GPIO DIN36_GPIO
#endif
#if (defined(DIN37_PORT) && defined(DIN37_BIT))
#define DIN37 167
#define DIN37_AHBEN (__rccgpioen__(DIN37_PORT))
#define DIN37_GPIO (__gpio__(DIN37_PORT))
#define DIO167 167
#define DIO167_PORT DIN37_PORT
#define DIO167_BIT DIN37_BIT
#define DIO167_AHBEN DIN37_AHBEN
#define DIO167_GPIO DIN37_GPIO
#endif
#if (defined(DIN38_PORT) && defined(DIN38_BIT))
#define DIN38 168
#define DIN38_AHBEN (__rccgpioen__(DIN38_PORT))
#define DIN38_GPIO (__gpio__(DIN38_PORT))
#define DIO168 168
#define DIO168_PORT DIN38_PORT
#define DIO168_BIT DIN38_BIT
#define DIO168_AHBEN DIN38_AHBEN
#define DIO168_GPIO DIN38_GPIO
#endif
#if (defined(DIN39_PORT) && defined(DIN39_BIT))
#define DIN39 169
#define DIN39_AHBEN (__rccgpioen__(DIN39_PORT))
#define DIN39_GPIO (__gpio__(DIN39_PORT))
#define DIO169 169
#define DIO169_PORT DIN39_PORT
#define DIO169_BIT DIN39_BIT
#define DIO169_AHBEN DIN39_AHBEN
#define DIO169_GPIO DIN39_GPIO
#endif
#if (defined(DIN40_PORT) && defined(DIN40_BIT))
#define DIN40 170
#define DIN40_AHBEN (__rccgpioen__(DIN40_PORT))
#define DIN40_GPIO (__gpio__(DIN40_PORT))
#define DIO170 170
#define DIO170_PORT DIN40_PORT
#define DIO170_BIT DIN40_BIT
#define DIO170_AHBEN DIN40_AHBEN
#define DIO170_GPIO DIN40_GPIO
#endif
#if (defined(DIN41_PORT) && defined(DIN41_BIT))
#define DIN41 171
#define DIN41_AHBEN (__rccgpioen__(DIN41_PORT))
#define DIN41_GPIO (__gpio__(DIN41_PORT))
#define DIO171 171
#define DIO171_PORT DIN41_PORT
#define DIO171_BIT DIN41_BIT
#define DIO171_AHBEN DIN41_AHBEN
#define DIO171_GPIO DIN41_GPIO
#endif
#if (defined(DIN42_PORT) && defined(DIN42_BIT))
#define DIN42 172
#define DIN42_AHBEN (__rccgpioen__(DIN42_PORT))
#define DIN42_GPIO (__gpio__(DIN42_PORT))
#define DIO172 172
#define DIO172_PORT DIN42_PORT
#define DIO172_BIT DIN42_BIT
#define DIO172_AHBEN DIN42_AHBEN
#define DIO172_GPIO DIN42_GPIO
#endif
#if (defined(DIN43_PORT) && defined(DIN43_BIT))
#define DIN43 173
#define DIN43_AHBEN (__rccgpioen__(DIN43_PORT))
#define DIN43_GPIO (__gpio__(DIN43_PORT))
#define DIO173 173
#define DIO173_PORT DIN43_PORT
#define DIO173_BIT DIN43_BIT
#define DIO173_AHBEN DIN43_AHBEN
#define DIO173_GPIO DIN43_GPIO
#endif
#if (defined(DIN44_PORT) && defined(DIN44_BIT))
#define DIN44 174
#define DIN44_AHBEN (__rccgpioen__(DIN44_PORT))
#define DIN44_GPIO (__gpio__(DIN44_PORT))
#define DIO174 174
#define DIO174_PORT DIN44_PORT
#define DIO174_BIT DIN44_BIT
#define DIO174_AHBEN DIN44_AHBEN
#define DIO174_GPIO DIN44_GPIO
#endif
#if (defined(DIN45_PORT) && defined(DIN45_BIT))
#define DIN45 175
#define DIN45_AHBEN (__rccgpioen__(DIN45_PORT))
#define DIN45_GPIO (__gpio__(DIN45_PORT))
#define DIO175 175
#define DIO175_PORT DIN45_PORT
#define DIO175_BIT DIN45_BIT
#define DIO175_AHBEN DIN45_AHBEN
#define DIO175_GPIO DIN45_GPIO
#endif
#if (defined(DIN46_PORT) && defined(DIN46_BIT))
#define DIN46 176
#define DIN46_AHBEN (__rccgpioen__(DIN46_PORT))
#define DIN46_GPIO (__gpio__(DIN46_PORT))
#define DIO176 176
#define DIO176_PORT DIN46_PORT
#define DIO176_BIT DIN46_BIT
#define DIO176_AHBEN DIN46_AHBEN
#define DIO176_GPIO DIN46_GPIO
#endif
#if (defined(DIN47_PORT) && defined(DIN47_BIT))
#define DIN47 177
#define DIN47_AHBEN (__rccgpioen__(DIN47_PORT))
#define DIN47_GPIO (__gpio__(DIN47_PORT))
#define DIO177 177
#define DIO177_PORT DIN47_PORT
#define DIO177_BIT DIN47_BIT
#define DIO177_AHBEN DIN47_AHBEN
#define DIO177_GPIO DIN47_GPIO
#endif
#if (defined(DIN48_PORT) && defined(DIN48_BIT))
#define DIN48 178
#define DIN48_AHBEN (__rccgpioen__(DIN48_PORT))
#define DIN48_GPIO (__gpio__(DIN48_PORT))
#define DIO178 178
#define DIO178_PORT DIN48_PORT
#define DIO178_BIT DIN48_BIT
#define DIO178_AHBEN DIN48_AHBEN
#define DIO178_GPIO DIN48_GPIO
#endif
#if (defined(DIN49_PORT) && defined(DIN49_BIT))
#define DIN49 179
#define DIN49_AHBEN (__rccgpioen__(DIN49_PORT))
#define DIN49_GPIO (__gpio__(DIN49_PORT))
#define DIO179 179
#define DIO179_PORT DIN49_PORT
#define DIO179_BIT DIN49_BIT
#define DIO179_AHBEN DIN49_AHBEN
#define DIO179_GPIO DIN49_GPIO
#endif
#if (defined(TX_PORT) && defined(TX_BIT))
#define TX 200
#define TX_AHBEN (__rccgpioen__(TX_PORT))
#define TX_GPIO (__gpio__(TX_PORT))
#define DIO200 200
#define DIO200_PORT TX_PORT
#define DIO200_BIT TX_BIT
#define DIO200_AHBEN TX_AHBEN
#define DIO200_GPIO TX_GPIO
#endif
#if (defined(RX_PORT) && defined(RX_BIT))
#define RX 201
#define RX_AHBEN (__rccgpioen__(RX_PORT))
#define RX_GPIO (__gpio__(RX_PORT))
#define DIO201 201
#define DIO201_PORT RX_PORT
#define DIO201_BIT RX_BIT
#define DIO201_AHBEN RX_AHBEN
#define DIO201_GPIO RX_GPIO
#endif
#if (defined(USB_DM_PORT) && defined(USB_DM_BIT))
#define USB_DM 202
#define USB_DM_AHBEN (__rccgpioen__(USB_DM_PORT))
#define USB_DM_GPIO (__gpio__(USB_DM_PORT))
#define DIO202 202
#define DIO202_PORT USB_DM_PORT
#define DIO202_BIT USB_DM_BIT
#define DIO202_AHBEN USB_DM_AHBEN
#define DIO202_GPIO USB_DM_GPIO
#endif
#if (defined(USB_DP_PORT) && defined(USB_DP_BIT))
#define USB_DP 203
#define USB_DP_AHBEN (__rccgpioen__(USB_DP_PORT))
#define USB_DP_GPIO (__gpio__(USB_DP_PORT))
#define DIO203 203
#define DIO203_PORT USB_DP_PORT
#define DIO203_BIT USB_DP_BIT
#define DIO203_AHBEN USB_DP_AHBEN
#define DIO203_GPIO USB_DP_GPIO
#endif
#if (defined(SPI_CLK_PORT) && defined(SPI_CLK_BIT))
#define SPI_CLK 204
#define SPI_CLK_AHBEN (__rccgpioen__(SPI_CLK_PORT))
#define SPI_CLK_GPIO (__gpio__(SPI_CLK_PORT))
#define DIO204 204
#define DIO204_PORT SPI_CLK_PORT
#define DIO204_BIT SPI_CLK_BIT
#define DIO204_AHBEN SPI_CLK_AHBEN
#define DIO204_GPIO SPI_CLK_GPIO
#endif
#if (defined(SPI_SDI_PORT) && defined(SPI_SDI_BIT))
#define SPI_SDI 205
#define SPI_SDI_AHBEN (__rccgpioen__(SPI_SDI_PORT))
#define SPI_SDI_GPIO (__gpio__(SPI_SDI_PORT))
#define DIO205 205
#define DIO205_PORT SPI_SDI_PORT
#define DIO205_BIT SPI_SDI_BIT
#define DIO205_AHBEN SPI_SDI_AHBEN
#define DIO205_GPIO SPI_SDI_GPIO
#endif
#if (defined(SPI_SDO_PORT) && defined(SPI_SDO_BIT))
#define SPI_SDO 206
#define SPI_SDO_AHBEN (__rccgpioen__(SPI_SDO_PORT))
#define SPI_SDO_GPIO (__gpio__(SPI_SDO_PORT))
#define DIO206 206
#define DIO206_PORT SPI_SDO_PORT
#define DIO206_BIT SPI_SDO_BIT
#define DIO206_AHBEN SPI_SDO_AHBEN
#define DIO206_GPIO SPI_SDO_GPIO
#endif
#if (defined(SPI_CS_PORT) && defined(SPI_CS_BIT))
#define SPI_CS 207
#define SPI_CS_AHBEN (__rccgpioen__(SPI_CS_PORT))
#define SPI_CS_GPIO (__gpio__(SPI_CS_PORT))
#define DIO207 207
#define DIO207_PORT SPI_CS_PORT
#define DIO207_BIT SPI_CS_BIT
#define DIO207_AHBEN SPI_CS_AHBEN
#define DIO207_GPIO SPI_CS_GPIO
#endif
#if (defined(I2C_CLK_PORT) && defined(I2C_CLK_BIT))
#define I2C_CLK 208
#define I2C_CLK_AHBEN (__rccgpioen__(I2C_CLK_PORT))
#define I2C_CLK_GPIO (__gpio__(I2C_CLK_PORT))
#define DIO208 208
#define DIO208_PORT I2C_CLK_PORT
#define DIO208_BIT I2C_CLK_BIT
#define DIO208_AHBEN I2C_CLK_AHBEN
#define DIO208_GPIO I2C_CLK_GPIO
#endif
#if (defined(I2C_DATA_PORT) && defined(I2C_DATA_BIT))
#define I2C_DATA 209
#define I2C_DATA_AHBEN (__rccgpioen__(I2C_DATA_PORT))
#define I2C_DATA_GPIO (__gpio__(I2C_DATA_PORT))
#define DIO209 209
#define DIO209_PORT I2C_DATA_PORT
#define DIO209_BIT I2C_DATA_BIT
#define DIO209_AHBEN I2C_DATA_AHBEN
#define DIO209_GPIO I2C_DATA_GPIO
#endif
#if (defined(TX2_PORT) && defined(TX2_BIT))
#define TX2 210
#define TX2_AHBEN (__rccgpioen__(TX2_PORT))
#define TX2_GPIO (__gpio__(TX2_PORT))
#define DIO210 210
#define DIO210_PORT TX2_PORT
#define DIO210_BIT TX2_BIT
#define DIO210_AHBEN TX2_AHBEN
#define DIO210_GPIO TX2_GPIO
#endif
#if (defined(RX2_PORT) && defined(RX2_BIT))
#define RX2 211
#define RX2_AHBEN (__rccgpioen__(RX2_PORT))
#define RX2_GPIO (__gpio__(RX2_PORT))
#define DIO211 211
#define DIO211_PORT RX2_PORT
#define DIO211_BIT RX2_BIT
#define DIO211_AHBEN RX2_AHBEN
#define DIO211_GPIO RX2_GPIO
#endif
#if (defined(SPI2_CLK_PORT) && defined(SPI2_CLK_BIT))
#define SPI2_CLK 212
#define SPI2_CLK_AHBEN (__rccgpioen__(SPI2_CLK_PORT))
#define SPI2_CLK_GPIO (__gpio__(SPI2_CLK_PORT))
#define DIO212 212
#define DIO212_PORT SPI2_CLK_PORT
#define DIO212_BIT SPI2_CLK_BIT
#define DIO212_AHBEN SPI2_CLK_AHBEN
#define DIO212_GPIO SPI2_CLK_GPIO
#endif
#if (defined(SPI2_SDI_PORT) && defined(SPI2_SDI_BIT))
#define SPI2_SDI 213
#define SPI2_SDI_AHBEN (__rccgpioen__(SPI2_SDI_PORT))
#define SPI2_SDI_GPIO (__gpio__(SPI2_SDI_PORT))
#define DIO213 213
#define DIO213_PORT SPI2_SDI_PORT
#define DIO213_BIT SPI2_SDI_BIT
#define DIO213_AHBEN SPI2_SDI_AHBEN
#define DIO213_GPIO SPI2_SDI_GPIO
#endif
#if (defined(SPI2_SDO_PORT) && defined(SPI2_SDO_BIT))
#define SPI2_SDO 214
#define SPI2_SDO_AHBEN (__rccgpioen__(SPI2_SDO_PORT))
#define SPI2_SDO_GPIO (__gpio__(SPI2_SDO_PORT))
#define DIO214 214
#define DIO214_PORT SPI2_SDO_PORT
#define DIO214_BIT SPI2_SDO_BIT
#define DIO214_AHBEN SPI2_SDO_AHBEN
#define DIO214_GPIO SPI2_SDO_GPIO
#endif
#if (defined(SPI2_CS_PORT) && defined(SPI2_CS_BIT))
#define SPI2_CS 215
#define SPI2_CS_AHBEN (__rccgpioen__(SPI2_CS_PORT))
#define SPI2_CS_GPIO (__gpio__(SPI2_CS_PORT))
#define DIO215 215
#define DIO215_PORT SPI2_CS_PORT
#define DIO215_BIT SPI2_CS_BIT
#define DIO215_AHBEN SPI2_CS_AHBEN
#define DIO215_GPIO SPI2_CS_GPIO
#endif

#if (defined(TX) && defined(RX))
#define MCU_HAS_UART
#endif
#if (defined(TX2) && defined(RX2))
#define MCU_HAS_UART2
#endif
#if (defined(USB_DP) && defined(USB_DM))
#define GPIO_OTG_FS 0x0A
#define MCU_HAS_USB
extern uint32_t tud_cdc_n_write_available(uint8_t itf);
extern uint32_t tud_cdc_n_available(uint8_t itf);
extern bool tud_cdc_n_connected(uint8_t itf);
#define usb_tx_available()                                                     \
  (tud_cdc_n_write_available(0) || !tud_cdc_n_connected(0))
#define usb_rx_available() tud_cdc_n_available(0)
#endif

/**********************************************
 *	ISR on change inputs
 **********************************************/
#define EXTINT_A 0
#define EXTINT_B 1
#define EXTINT_C 2
#define EXTINT_D 3
#define EXTINT_E 4
#define EXTINT_F 5
#define EXTINT_G 6
#define EXTINT_H 7
#define EXTINT_I 8
#define EXTINT_J 9
#define EXTINT_K 10

#define _EXTINT(X) EXTINT_##X
#define EXTINT(X) _EXTINT(X)

