Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcumap_stm32f0x.h
#define DIO35_CLOCK PWM10_CLOCK
#endif
#if (defined(PWM11_CHANNEL) && defined(PWM11_TIMER) && defined(PWM11))
#if (PWM11_TIMER == 1 || (PWM11_TIMER >= 15 & PWM11_TIMER <= 17))
#define PWM11_ENREG RCC->APB2ENR
#define PWM11_APBEN __helper__(RCC_APB2ENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define PWM11_ENREG RCC->APB1ENR
#define PWM11_APBEN __helper__(RCC_APB1ENR_TIM, PWM11_TIMER, EN)
#define PWM11_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM11_TIMREG (__tim__(PWM11_TIMER))
#ifndef PWM11_FREQ
#define PWM11_FREQ 1000
#endif
#if (PWM11_CHANNEL & 0x01)
#define PWM11_MODE 0x0064
#else
#define PWM11_MODE 0x6400
#endif
#if (PWM11_CHANNEL > 2)
#define PWM11_CCMREG CCMR2
#else
#define PWM11_CCMREG CCMR1
#endif
#if (PWM11_TIMER == 1) || (PWM11_TIMER >= 15 & PWM11_TIMER <= 17)
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
    PWM11_TIMREG->BDTR |= (1 << 15);                                           \
  }
#else
#define PWM11_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM11_TIMER == 1)
#define PWM11_AF 0x02
#elif (PWM11_PORT == A)
#if (PWM11_TIMER == 3)
#define PWM11_AF 0x01
#elif (PWM11_TIMER == 14)
#define PWM11_AF 0x04
#elif (PWM11_TIMER == 15)
#define PWM11_AF 0x00
#elif (PWM11_TIMER == 16) || (PWM11_TIMER == 17)
#define PWM11_AF 0x05
#endif
#elif (PWM11_PORT == B)
#if (PWM11_TIMER == 14)
#define PWM11_AF 0x00
#elif (PWM11_TIMER == 15)
#define PWM11_AF 0x01
#elif (PWM11_TIMER == 16) || (PWM11_TIMER == 17)
#define PWM11_AF 0x02
#endif
#elif (PWM11_PORT == C)
#if (PWM11_TIMER == 3)
#define PWM11_AF 0x00
#endif
#endif
#define PWM11_CCR __ccr__(PWM11_CHANNEL)
#define DIO36_TIMER PWM11_TIMER
#define DIO36_CHANNEL PWM11_CHANNEL
#define DIO36_ENREG PWM11_ENREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_TIMREG PWM11_TIMREG
#define DIO36_APBEN PWM11_APBEN
#define DIO36_FREQ PWM11_FREQ
#define DIO36_MODE PWM11_MODE
#define DIO36_CCMREG PWM11_CCMREG
#define DIO36_CCR PWM11_CCR
#define DIO36_ENOUTPUT PWM11_ENOUTPUT
#define DIO36_AF PWM11_AF
#define DIO36_CLOCK PWM11_CLOCK
#endif
#if (defined(PWM12_CHANNEL) && defined(PWM12_TIMER) && defined(PWM12))
#if (PWM12_TIMER == 1 || (PWM12_TIMER >= 15 & PWM12_TIMER <= 17))
#define PWM12_ENREG RCC->APB2ENR
#define PWM12_APBEN __helper__(RCC_APB2ENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define PWM12_ENREG RCC->APB1ENR
#define PWM12_APBEN __helper__(RCC_APB1ENR_TIM, PWM12_TIMER, EN)
#define PWM12_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM12_TIMREG (__tim__(PWM12_TIMER))
#ifndef PWM12_FREQ
#define PWM12_FREQ 1000
#endif
#if (PWM12_CHANNEL & 0x01)
#define PWM12_MODE 0x0064
#else
#define PWM12_MODE 0x6400
#endif
#if (PWM12_CHANNEL > 2)
#define PWM12_CCMREG CCMR2
#else
#define PWM12_CCMREG CCMR1
#endif
#if (PWM12_TIMER == 1) || (PWM12_TIMER >= 15 & PWM12_TIMER <= 17)
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
    PWM12_TIMREG->BDTR |= (1 << 15);                                           \
  }
#else
#define PWM12_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM12_TIMER == 1)
#define PWM12_AF 0x02
#elif (PWM12_PORT == A)
#if (PWM12_TIMER == 3)
#define PWM12_AF 0x01
#elif (PWM12_TIMER == 14)
#define PWM12_AF 0x04
#elif (PWM12_TIMER == 15)
#define PWM12_AF 0x00
#elif (PWM12_TIMER == 16) || (PWM12_TIMER == 17)
#define PWM12_AF 0x05
#endif
#elif (PWM12_PORT == B)
#if (PWM12_TIMER == 14)
#define PWM12_AF 0x00
#elif (PWM12_TIMER == 15)
#define PWM12_AF 0x01
#elif (PWM12_TIMER == 16) || (PWM12_TIMER == 17)
#define PWM12_AF 0x02
#endif
#elif (PWM12_PORT == C)
#if (PWM12_TIMER == 3)
#define PWM12_AF 0x00
#endif
#endif
#define PWM12_CCR __ccr__(PWM12_CHANNEL)
#define DIO37_TIMER PWM12_TIMER
#define DIO37_CHANNEL PWM12_CHANNEL
#define DIO37_ENREG PWM12_ENREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_TIMREG PWM12_TIMREG
#define DIO37_APBEN PWM12_APBEN
#define DIO37_FREQ PWM12_FREQ
#define DIO37_MODE PWM12_MODE
#define DIO37_CCMREG PWM12_CCMREG
#define DIO37_CCR PWM12_CCR
#define DIO37_ENOUTPUT PWM12_ENOUTPUT
#define DIO37_AF PWM12_AF
#define DIO37_CLOCK PWM12_CLOCK
#endif
#if (defined(PWM13_CHANNEL) && defined(PWM13_TIMER) && defined(PWM13))
#if (PWM13_TIMER == 1 || (PWM13_TIMER >= 15 & PWM13_TIMER <= 17))
#define PWM13_ENREG RCC->APB2ENR
#define PWM13_APBEN __helper__(RCC_APB2ENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define PWM13_ENREG RCC->APB1ENR
#define PWM13_APBEN __helper__(RCC_APB1ENR_TIM, PWM13_TIMER, EN)
#define PWM13_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM13_TIMREG (__tim__(PWM13_TIMER))
#ifndef PWM13_FREQ
#define PWM13_FREQ 1000
#endif
#if (PWM13_CHANNEL & 0x01)
#define PWM13_MODE 0x0064
#else
#define PWM13_MODE 0x6400
#endif
#if (PWM13_CHANNEL > 2)
#define PWM13_CCMREG CCMR2
#else
#define PWM13_CCMREG CCMR1
#endif
#if (PWM13_TIMER == 1) || (PWM13_TIMER >= 15 & PWM13_TIMER <= 17)
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
    PWM13_TIMREG->BDTR |= (1 << 15);                                           \
  }
#else
#define PWM13_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM13_TIMER == 1)
#define PWM13_AF 0x02
#elif (PWM13_PORT == A)
#if (PWM13_TIMER == 3)
#define PWM13_AF 0x01
#elif (PWM13_TIMER == 14)
#define PWM13_AF 0x04
#elif (PWM13_TIMER == 15)
#define PWM13_AF 0x00
#elif (PWM13_TIMER == 16) || (PWM13_TIMER == 17)
#define PWM13_AF 0x05
#endif
#elif (PWM13_PORT == B)
#if (PWM13_TIMER == 14)
#define PWM13_AF 0x00
#elif (PWM13_TIMER == 15)
#define PWM13_AF 0x01
#elif (PWM13_TIMER == 16) || (PWM13_TIMER == 17)
#define PWM13_AF 0x02
#endif
#elif (PWM13_PORT == C)
#if (PWM13_TIMER == 3)
#define PWM13_AF 0x00
#endif
#endif
#define PWM13_CCR __ccr__(PWM13_CHANNEL)
#define DIO38_TIMER PWM13_TIMER
#define DIO38_CHANNEL PWM13_CHANNEL
#define DIO38_ENREG PWM13_ENREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_TIMREG PWM13_TIMREG
#define DIO38_APBEN PWM13_APBEN
#define DIO38_FREQ PWM13_FREQ
#define DIO38_MODE PWM13_MODE
#define DIO38_CCMREG PWM13_CCMREG
#define DIO38_CCR PWM13_CCR
#define DIO38_ENOUTPUT PWM13_ENOUTPUT
#define DIO38_AF PWM13_AF
#define DIO38_CLOCK PWM13_CLOCK
#endif
#if (defined(PWM14_CHANNEL) && defined(PWM14_TIMER) && defined(PWM14))
#if (PWM14_TIMER == 1 || (PWM14_TIMER >= 15 & PWM14_TIMER <= 17))
#define PWM14_ENREG RCC->APB2ENR
#define PWM14_APBEN __helper__(RCC_APB2ENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define PWM14_ENREG RCC->APB1ENR
#define PWM14_APBEN __helper__(RCC_APB1ENR_TIM, PWM14_TIMER, EN)
#define PWM14_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM14_TIMREG (__tim__(PWM14_TIMER))
#ifndef PWM14_FREQ
#define PWM14_FREQ 1000
#endif
#if (PWM14_CHANNEL & 0x01)
#define PWM14_MODE 0x0064
#else
#define PWM14_MODE 0x6400
#endif
#if (PWM14_CHANNEL > 2)
#define PWM14_CCMREG CCMR2
#else
#define PWM14_CCMREG CCMR1
#endif
#if (PWM14_TIMER == 1) || (PWM14_TIMER >= 15 & PWM14_TIMER <= 17)
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
    PWM14_TIMREG->BDTR |= (1 << 15);                                           \
  }
#else
#define PWM14_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM14_TIMER == 1)
#define PWM14_AF 0x02
#elif (PWM14_PORT == A)
#if (PWM14_TIMER == 3)
#define PWM14_AF 0x01
#elif (PWM14_TIMER == 14)
#define PWM14_AF 0x04
#elif (PWM14_TIMER == 15)
#define PWM14_AF 0x00
#elif (PWM14_TIMER == 16) || (PWM14_TIMER == 17)
#define PWM14_AF 0x05
#endif
#elif (PWM14_PORT == B)
#if (PWM14_TIMER == 14)
#define PWM14_AF 0x00
#elif (PWM14_TIMER == 15)
#define PWM14_AF 0x01
#elif (PWM14_TIMER == 16) || (PWM14_TIMER == 17)
#define PWM14_AF 0x02
#endif
#elif (PWM14_PORT == C)
#if (PWM14_TIMER == 3)
#define PWM14_AF 0x00
#endif
#endif
#define PWM14_CCR __ccr__(PWM14_CHANNEL)
#define DIO39_TIMER PWM14_TIMER
#define DIO39_CHANNEL PWM14_CHANNEL
#define DIO39_ENREG PWM14_ENREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_TIMREG PWM14_TIMREG
#define DIO39_APBEN PWM14_APBEN
#define DIO39_FREQ PWM14_FREQ
#define DIO39_MODE PWM14_MODE
#define DIO39_CCMREG PWM14_CCMREG
#define DIO39_CCR PWM14_CCR
#define DIO39_ENOUTPUT PWM14_ENOUTPUT
#define DIO39_AF PWM14_AF
#define DIO39_CLOCK PWM14_CLOCK
#endif
#if (defined(PWM15_CHANNEL) && defined(PWM15_TIMER) && defined(PWM15))
#if (PWM15_TIMER == 1 || (PWM15_TIMER >= 15 & PWM15_TIMER <= 17))
#define PWM15_ENREG RCC->APB2ENR
#define PWM15_APBEN __helper__(RCC_APB2ENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define PWM15_ENREG RCC->APB1ENR
#define PWM15_APBEN __helper__(RCC_APB1ENR_TIM, PWM15_TIMER, EN)
#define PWM15_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#define PWM15_TIMREG (__tim__(PWM15_TIMER))
#ifndef PWM15_FREQ
#define PWM15_FREQ 1000
#endif
#if (PWM15_CHANNEL & 0x01)
#define PWM15_MODE 0x0064
#else
#define PWM15_MODE 0x6400
#endif
#if (PWM15_CHANNEL > 2)
#define PWM15_CCMREG CCMR2
#else
#define PWM15_CCMREG CCMR1
#endif
#if (PWM15_TIMER == 1) || (PWM15_TIMER >= 15 & PWM15_TIMER <= 17)
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
    PWM15_TIMREG->BDTR |= (1 << 15);                                           \
  }
#else
#define PWM15_ENOUTPUT                                                         \
  {                                                                            \
  }
#endif
#if (PWM15_TIMER == 1)
#define PWM15_AF 0x02
#elif (PWM15_PORT == A)
#if (PWM15_TIMER == 3)
#define PWM15_AF 0x01
#elif (PWM15_TIMER == 14)
#define PWM15_AF 0x04
#elif (PWM15_TIMER == 15)
#define PWM15_AF 0x00
#elif (PWM15_TIMER == 16) || (PWM15_TIMER == 17)
#define PWM15_AF 0x05
#endif
#elif (PWM15_PORT == B)
#if (PWM15_TIMER == 14)
#define PWM15_AF 0x00
#elif (PWM15_TIMER == 15)
#define PWM15_AF 0x01
#elif (PWM15_TIMER == 16) || (PWM15_TIMER == 17)
#define PWM15_AF 0x02
#endif
#elif (PWM15_PORT == C)
#if (PWM15_TIMER == 3)
#define PWM15_AF 0x00
#endif
#endif
#define PWM15_CCR __ccr__(PWM15_CHANNEL)
#define DIO40_TIMER PWM15_TIMER
#define DIO40_CHANNEL PWM15_CHANNEL
#define DIO40_ENREG PWM15_ENREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_TIMREG PWM15_TIMREG
#define DIO40_APBEN PWM15_APBEN
#define DIO40_FREQ PWM15_FREQ
#define DIO40_MODE PWM15_MODE
#define DIO40_CCMREG PWM15_CCMREG
#define DIO40_CCR PWM15_CCR
#define DIO40_ENOUTPUT PWM15_ENOUTPUT
#define DIO40_AF PWM15_AF
#define DIO40_CLOCK PWM15_CLOCK
#endif

/**********************************************
 *	Analog pins
 **********************************************/
#ifdef ANALOG0
#ifndef ANALOG0_CHANNEL
#define ANALOG0_CHANNEL -1
#endif
#define DIO114_CHANNEL ANALOG0_CHANNEL
#endif
#ifdef ANALOG1
#ifndef ANALOG1_CHANNEL
#define ANALOG1_CHANNEL -1
#endif
#define DIO115_CHANNEL ANALOG1_CHANNEL
#endif
#ifdef ANALOG2
#ifndef ANALOG2_CHANNEL
#define ANALOG2_CHANNEL -1
#endif
#define DIO116_CHANNEL ANALOG2_CHANNEL
#endif
#ifdef ANALOG3
#ifndef ANALOG3_CHANNEL
#define ANALOG3_CHANNEL -1
#endif
#define DIO117_CHANNEL ANALOG3_CHANNEL
#endif
#ifdef ANALOG4
#ifndef ANALOG4_CHANNEL
#define ANALOG4_CHANNEL -1
#endif
#define DIO118_CHANNEL ANALOG4_CHANNEL
#endif
#ifdef ANALOG5
#ifndef ANALOG5_CHANNEL
#define ANALOG5_CHANNEL -1
#endif
#define DIO119_CHANNEL ANALOG5_CHANNEL
#endif
#ifdef ANALOG6
#ifndef ANALOG6_CHANNEL
#define ANALOG6_CHANNEL -1
#endif
#define DIO120_CHANNEL ANALOG6_CHANNEL
#endif
#ifdef ANALOG7
#ifndef ANALOG7_CHANNEL
#define ANALOG7_CHANNEL -1
#endif
#define DIO121_CHANNEL ANALOG7_CHANNEL
#endif
#ifdef ANALOG8
#ifndef ANALOG8_CHANNEL
#define ANALOG8_CHANNEL -1
#endif
#define DIO122_CHANNEL ANALOG8_CHANNEL
#endif
#ifdef ANALOG9
#ifndef ANALOG9_CHANNEL
#define ANALOG9_CHANNEL -1
#endif
#define DIO123_CHANNEL ANALOG9_CHANNEL
#endif
#ifdef ANALOG10
#ifndef ANALOG10_CHANNEL
#define ANALOG10_CHANNEL -1
#endif
#define DIO124_CHANNEL ANALOG10_CHANNEL
#endif
#ifdef ANALOG11
#ifndef ANALOG11_CHANNEL
#define ANALOG11_CHANNEL -1
#endif
#define DIO125_CHANNEL ANALOG11_CHANNEL
#endif
#ifdef ANALOG12
#ifndef ANALOG12_CHANNEL
#define ANALOG12_CHANNEL -1
#endif
#define DIO126_CHANNEL ANALOG12_CHANNEL
#endif
#ifdef ANALOG13
#ifndef ANALOG13_CHANNEL
#define ANALOG13_CHANNEL -1
#endif
#define DIO127_CHANNEL ANALOG13_CHANNEL
#endif
#ifdef ANALOG14
#ifndef ANALOG14_CHANNEL
#define ANALOG14_CHANNEL -1
#endif
#define DIO128_CHANNEL ANALOG14_CHANNEL
#endif
#ifdef ANALOG15
#ifndef ANALOG15_CHANNEL
#define ANALOG15_CHANNEL -1
#endif
#define DIO129_CHANNEL ANALOG15_CHANNEL
#endif

// COM registers
#ifdef MCU_HAS_UART
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#define COM_UART __usart__(UART_PORT)

#if (UART_PORT < 3)
#define COM_IRQ __helper__(USART, UART_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(USART, UART_PORT, _IRQHandler)
#else
#define COM_IRQ USART3_8_IRQn
#define MCU_SERIAL_ISR USART3_8_IRQHandler
#endif

#define COM_OUTREG (COM_UART)->TDR
#define COM_INREG (COM_UART)->RDR

#if (UART_PORT == 1 || UART_PORT >= 6)
#define COM_APB APB2ENR
#define COM_APBEN __helper__(RCC_APB2ENR_USART, UART_PORT, EN)
#else
#define COM_APB APB1ENR
#define COM_APBEN __helper__(RCC_APB1ENR_USART, UART_PORT, EN)
#endif

#define UART_CLOCK HAL_RCC_GetPCLK1Freq()

#define TX_PIN __iopin__(TX_PORT, TX_BIT)
#define RX_PIN __iopin__(RX_PORT, RX_BIT)

#if (UART_PORT == 2) && (TX_PIN == STM32IO_A2)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 2) && (RX_PIN == STM32IO_A3)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 1) && (TX_PIN == STM32IO_A9)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 1) && (RX_PIN == STM32IO_A10)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 2) && (TX_PIN == STM32IO_A14)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 2) && (RX_PIN == STM32IO_A15)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 4) && (TX_PIN == STM32IO_A0)
#define UART_TX_AFIO 4
#endif
#if (UART_PORT == 4) && (RX_PIN == STM32IO_A1)
#define UART_RX_AFIO 4
#endif
#if (UART_PORT == 5) && (TX_PIN == STM32IO_A4)
#define UART_TX_AFIO 5
#endif
#if (UART_PORT == 5) && (RX_PIN == STM32IO_A5)
#define UART_RX_AFIO 5
#endif
#if (UART_PORT == 1) && (TX_PIN == STM32IO_B6)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 1) && (RX_PIN == STM32IO_B7)
#define UART_RX_AFIO 0
#endif
#if (UART_PORT == 5) && (TX_PIN == STM32IO_B3)
#define UART_TX_AFIO 4
#endif
#if (UART_PORT == 5) && (RX_PIN == STM32IO_B4)
#define UART_RX_AFIO 4
#endif
#if (UART_PORT == 3) && (TX_PIN == STM32IO_B10)
#define UART_TX_AFIO 4
#endif
#if (UART_PORT == 3) && (RX_PIN == STM32IO_B11)
#define UART_RX_AFIO 4
#endif
#if (UART_PORT == 4) && (TX_PIN == STM32IO_C10)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 4) && (RX_PIN == STM32IO_C11)
#define UART_RX_AFIO 0
#endif
#if (UART_PORT == 7) && (TX_PIN == STM32IO_C0)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 7) && (RX_PIN == STM32IO_C1)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 7) && (TX_PIN == STM32IO_C6)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 7) && (RX_PIN == STM32IO_C7)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 3) && (TX_PIN == STM32IO_C4)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 3) && (RX_PIN == STM32IO_C5)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 3) && (TX_PIN == STM32IO_C10)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 3) && (RX_PIN == STM32IO_C11)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 8) && (TX_PIN == STM32IO_C8)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 8) && (RX_PIN == STM32IO_C9)
#define UART_RX_AFIO 1
#endif
#if (UART_PORT == 6) && (TX_PIN == STM32IO_C0)
#define UART_TX_AFIO 2
#endif
#if (UART_PORT == 6) && (RX_PIN == STM32IO_C1)
#define UART_RX_AFIO 2
#endif
#if (UART_PORT == 8) && (TX_PIN == STM32IO_C2)
#define UART_TX_AFIO 2
#endif
#if (UART_PORT == 8) && (RX_PIN == STM32IO_C3)
#define UART_RX_AFIO 2
#endif
#if (UART_PORT == 5) && (TX_PIN == STM32IO_C12)
#define UART_TX_AFIO 2
#endif
#if (UART_PORT == 5) && (RX_PIN == STM32IO_D2)
#define UART_RX_AFIO 2
#endif
#if (UART_PORT == 2) && (TX_PIN == STM32IO_D5)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 2) && (TX_PIN == STM32IO_D6)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 3) && (TX_PIN == STM32IO_D8)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 3) && (RX_PIN == STM32IO_D9)
#define UART_RX_AFIO 0
#endif
#if (UART_PORT == 8) && (TX_PIN == STM32IO_D13)
#define UART_TX_AFIO 0
#endif
#if (UART_PORT == 8) && (RX_PIN == STM32IO_D14)
#define UART_RX_AFIO 0
#endif
#if (UART_PORT == 4) && (TX_PIN == STM32IO_E8)
#define UART_TX_AFIO 2
#endif
#if (UART_PORT == 4) && (RX_PIN == STM32IO_E9)
#define UART_RX_AFIO 2
#endif
#if (UART_PORT == 5) && (TX_PIN == STM32IO_E10)
#define UART_TX_AFIO 2
#endif
#if (UART_PORT == 5) && (RX_PIN == STM32IO_E11)
#define UART_RX_AFIO 2
#endif
#if (UART_PORT == 7) && (TX_PIN == STM32IO_F2)
#define UART_TX_AFIO 1
#endif
#if (UART_PORT == 7) && (RX_PIN == STM32IO_F3)
#define UART_RX_AFIO 1
#endif

#endif

#ifdef MCU_HAS_UART2
#ifndef BAUDRATE2
#define BAUDRATE2 BAUDRATE
#endif
// this MCU does not work well with both TX and RX interrupt
// this forces the sync TX method to fix communication
#define COM2_UART __usart__(UART2_PORT)

#if (UART2_PORT < 3)
#define COM2_IRQ __helper__(USART, UART2_PORT, _IRQn)
#define MCU_SERIAL_ISR __helper__(USART, UART2_PORT, _IRQHandler)
#else
#define COM2_IRQ USART3_8_IRQn
#define MCU_SERIAL_ISR USART3_8_IRQHandler
#endif

#define COM2_OUTREG (COM2_UART)->TDR
#define COM2_INREG (COM2_UART)->RDR

#if (UART2_PORT == 1 || UART2_PORT >= 6)
#define COM2_APB APB2ENR
#define COM2_APBEN __helper__(RCC_APB2ENR_USART, UART2_PORT, EN)
#else
#define COM2_APB APB1ENR
#define COM2_APBEN __helper__(RCC_APB1ENR_USART, UART2_PORT, EN)
#endif

