Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcumap_stm32f0x.h
#define UART2_CLOCK HAL_RCC_GetPCLK1Freq()

#define TX2_PIN __iopin__(TX2_PORT, TX2_BIT)
#define RX2_PIN __iopin__(RX_PORT, RX_BIT)

#if (UART2_PORT == 2) && (TX2_PIN == STM32IO_A2)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 2) && (RX2_PIN == STM32IO_A3)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 1) && (TX2_PIN == STM32IO_A9)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 1) && (RX2_PIN == STM32IO_A10)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 2) && (TX2_PIN == STM32IO_A14)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 2) && (RX2_PIN == STM32IO_A15)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 4) && (TX2_PIN == STM32IO_A0)
#define UART2_TX_AFIO 4
#endif
#if (UART2_PORT == 4) && (RX2_PIN == STM32IO_A1)
#define UART2_RX_AFIO 4
#endif
#if (UART2_PORT == 5) && (TX2_PIN == STM32IO_A4)
#define UART2_TX_AFIO 5
#endif
#if (UART2_PORT == 5) && (RX2_PIN == STM32IO_A5)
#define UART2_RX_AFIO 5
#endif
#if (UART2_PORT == 1) && (TX2_PIN == STM32IO_B6)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 1) && (RX2_PIN == STM32IO_B7)
#define UART2_RX_AFIO 0
#endif
#if (UART2_PORT == 5) && (TX2_PIN == STM32IO_B3)
#define UART2_TX_AFIO 4
#endif
#if (UART2_PORT == 5) && (RX2_PIN == STM32IO_B4)
#define UART2_RX_AFIO 4
#endif
#if (UART2_PORT == 3) && (TX2_PIN == STM32IO_B10)
#define UART2_TX_AFIO 4
#endif
#if (UART2_PORT == 3) && (RX2_PIN == STM32IO_B11)
#define UART2_RX_AFIO 4
#endif
#if (UART2_PORT == 4) && (TX2_PIN == STM32IO_C10)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 4) && (RX2_PIN == STM32IO_C11)
#define UART2_RX_AFIO 0
#endif
#if (UART2_PORT == 7) && (TX2_PIN == STM32IO_C0)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 7) && (RX2_PIN == STM32IO_C1)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 7) && (TX2_PIN == STM32IO_C6)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 7) && (RX2_PIN == STM32IO_C7)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 3) && (TX2_PIN == STM32IO_C4)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 3) && (RX2_PIN == STM32IO_C5)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 3) && (TX2_PIN == STM32IO_C10)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 3) && (RX2_PIN == STM32IO_C11)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 8) && (TX2_PIN == STM32IO_C8)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 8) && (RX2_PIN == STM32IO_C9)
#define UART2_RX_AFIO 1
#endif
#if (UART2_PORT == 6) && (TX2_PIN == STM32IO_C0)
#define UART2_TX_AFIO 2
#endif
#if (UART2_PORT == 6) && (RX2_PIN == STM32IO_C1)
#define UART2_RX_AFIO 2
#endif
#if (UART2_PORT == 8) && (TX2_PIN == STM32IO_C2)
#define UART2_TX_AFIO 2
#endif
#if (UART2_PORT == 8) && (RX2_PIN == STM32IO_C3)
#define UART2_RX_AFIO 2
#endif
#if (UART2_PORT == 5) && (TX2_PIN == STM32IO_C12)
#define UART2_TX_AFIO 2
#endif
#if (UART2_PORT == 5) && (RX2_PIN == STM32IO_D2)
#define UART2_RX_AFIO 2
#endif
#if (UART2_PORT == 2) && (TX2_PIN == STM32IO_D5)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 2) && (TX2_PIN == STM32IO_D6)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 3) && (TX2_PIN == STM32IO_D8)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 3) && (RX2_PIN == STM32IO_D9)
#define UART2_RX_AFIO 0
#endif
#if (UART2_PORT == 8) && (TX2_PIN == STM32IO_D13)
#define UART2_TX_AFIO 0
#endif
#if (UART2_PORT == 8) && (RX2_PIN == STM32IO_D14)
#define UART2_RX_AFIO 0
#endif
#if (UART2_PORT == 4) && (TX2_PIN == STM32IO_E8)
#define UART2_TX_AFIO 2
#endif
#if (UART2_PORT == 4) && (RX2_PIN == STM32IO_E9)
#define UART2_RX_AFIO 2
#endif
#if (UART2_PORT == 5) && (TX2_PIN == STM32IO_E10)
#define UART2_TX_AFIO 2
#endif
#if (UART2_PORT == 5) && (RX2_PIN == STM32IO_E11)
#define UART2_RX_AFIO 2
#endif
#if (UART2_PORT == 7) && (TX2_PIN == STM32IO_F2)
#define UART2_TX_AFIO 1
#endif
#if (UART2_PORT == 7) && (RX2_PIN == STM32IO_F3)
#define UART2_RX_AFIO 1
#endif

#endif

#if (defined(SPI_CLK) && defined(SPI_SDO) && defined(SPI_SDI))
#define SPI_CLK_PIN __iopin__(SPI_CLK_PORT, SPI_CLK_BIT)
#define SPI_SDO_PIN __iopin__(SPI_SDO_PORT, SPI_SDO_BIT)
#define SPI_SDI_PIN __iopin__(SPI_SDI_PORT, SPI_SDI_BIT)
#ifdef SPI_CS
#define SPI_CS_PIN __iopin__(SPI_CS_PORT, SPI_CS_BIT)
#endif
#define MCU_HAS_SPI
#ifndef SPI_PORT
#define SPI_PORT 1
#endif
#ifndef SPI_MODE
#define SPI_MODE 0
#endif
#ifndef SPI_FREQ
#define SPI_FREQ 1000000UL
#endif
// remmaping and pin checking
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_A1)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_B12)
#define SPI_CLK_AFIO 7
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_A5)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_A6)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_A7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 1) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B9)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B10)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CS_PIN == STM32IO_B12)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_B13)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_B14)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_B15)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDI_PIN == STM32IO_C2)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_SDO_PIN == STM32IO_C3)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_C7)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 2) && (SPI_CLK_PIN == STM32IO_D3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_D6)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E3)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E5)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E6)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E7)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_E11)
#define SPI_CS_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_E12)
#define SPI_CLK_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_E13)
#define SPI_SDI_AFIO 5
#endif
#if (SPI_PORT == 4) && (SPI_SDO_PIN == STM32IO_E14)
#define SPI_SDO_AFIO 5
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A4)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_A10)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_SDI_PIN == STM32IO_A11)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_A12)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CS_PIN == STM32IO_A15)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_B0)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CD_PIN == STM32IO_B1)
#define SPI_CD_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_B3)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_B4)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_B5)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_B8)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_CS_PIN == STM32IO_B12)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 4) && (SPI_CLK_PIN == STM32IO_B13)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_CLK_PIN == STM32IO_C10)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDI_PIN == STM32IO_C11)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 3) && (SPI_SDO_PIN == STM32IO_C12)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_E3)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_E5)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_E6)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_E7)
#define SPI_SDO_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CS_PIN == STM32IO_E11)
#define SPI_CS_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_CLK_PIN == STM32IO_E12)
#define SPI_CLK_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDI_PIN == STM32IO_E13)
#define SPI_SDI_AFIO 6
#endif
#if (SPI_PORT == 5) && (SPI_SDO_PIN == STM32IO_E14)
#define SPI_SDO_AFIO 6
#endif

#ifndef SPI_CLK_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDO_AFIO
#error "SPI pin configuration not supported"
#endif
#ifndef SPI_SDI_AFIO
#error "SPI pin configuration not supported"
#endif
// #ifdef SPI_CS
// #ifndef SPI_CS_AFIO
// #error "SPI pin configuration not supported"
// #endif
// #endif

#define SPI_REG __helper__(SPI, SPI_PORT, )
#if (SPI_PORT == 2 || SPI_PORT == 3)
#define SPI_ENREG RCC->APB1ENR
#define SPI_ENVAL __helper__(RCC_APB1ENR_SPI, SPI_PORT, EN)
#define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SPI_ENREG RCC->APB2ENR
#define SPI_ENVAL __helper__(RCC_APB2ENR_SPI, SPI_PORT, EN)
#define SPI_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#if (SPI_PORT == 1)
#define SPI_DMA_TX_CHANNEL_NUM 3
#define SPI_DMA_RX_CHANNEL_NUM 2
#define SPI_DMA_TX_IFR_POS 8
#define SPI_DMA_RX_IFR_POS 4
#elif (SPI_PORT == 2)
#define SPI_DMA_TX_CHANNEL_NUM 5
#define SPI_DMA_RX_CHANNEL_NUM 4
#define SPI_DMA_TX_IFR_POS 16
#define SPI_DMA_RX_IFR_POS 12
#endif

