Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcumap_stm32f0x.h
#define SPI2_DMA_TX_CHANNEL __helper__(DMA1_Channel, SPI2_DMA_TX_CHANNEL_NUM, )
#define SPI2_DMA_RX_CHANNEL __helper__(DMA1_Channel, SPI2_DMA_RX_CHANNEL_NUM, )

#define SPI2_DMA_TX_IFCR_MASK (0b1111 << SPI2_DMA_TX_IFR_POS)
#define SPI2_DMA_RX_IFCR_MASK (0b1111 << SPI2_DMA_RX_IFR_POS)

#define SPI2_IRQ __helper__(SPI, SPI2_PORT, _IRQn)
#define SPI2_ISR __helper__(SPI, SPI2_PORT, _IRQHandler)

#endif

// I2C
#if (defined(I2C_CLK) && defined(I2C_DATA))

#define I2C_CLK_PIN __iopin__(I2C_CLK_PORT, I2C_CLK_BIT)
#define I2C_DATA_PIN __iopin__(I2C_DATA_PORT, I2C_DATA_BIT)

#define MCU_HAS_I2C
#define MCU_SUPPORTS_I2C_SLAVE
#ifndef I2C_ADDRESS
#define I2C_ADDRESS 0
#endif

#ifndef I2C_PORT
#define I2C_PORT 1
#endif

#define I2C_APBEN __helper__(RCC_APB1ENR_I2C, I2C_PORT, EN)
#define I2C_REG __helper__(I2C, I2C_PORT, )
#define I2C_SPEEDRANGE (HAL_RCC_GetPCLK1Freq() / 1000000UL)

#if (I2C_PORT == 1) && (I2C_CLK_PIN == STM32IO_A9)
#define I2C_CLK_AFIO 4
#endif
#if (I2C_PORT == 1) && (I2C_DATA_PIN == STM32IO_A10)
#define I2C_DATA_AFIO 4
#endif
#if (I2C_PORT == 1) && (I2C_CLK_PIN == STM32IO_B6)
#define I2C_CLK_AFIO 1
#endif
#if (I2C_PORT == 1) && (I2C_DATA_PIN == STM32IO_B7)
#define I2C_DATA_AFIO 1
#endif
#if (I2C_PORT == 1) && (I2C_CLK_PIN == STM32IO_B8)
#define I2C_CLK_AFIO 1
#endif
#if (I2C_PORT == 1) && (I2C_DATA_PIN == STM32IO_B9)
#define I2C_DATA_AFIO 1
#endif
#if ((I2C_PORT == 1) || (I2C_PORT == 2)) && (I2C_CLK_PIN == STM32IO_B10)
#define I2C_CLK_AFIO 1
#endif
#if ((I2C_PORT == 1) || (I2C_PORT == 2)) && (I2C_DATA_PIN == STM32IO_B11)
#define I2C_DATA_AFIO 1
#endif
#if (I2C_PORT == 2) && (I2C_CLK_PIN == STM32IO_B13)
#define I2C_CLK_AFIO 5
#endif
#if (I2C_PORT == 2) && (I2C_DATA_PIN == STM32IO_B14)
#define I2C_DATA_AFIO 5
#endif
#if (I2C_PORT == 1) && (I2C_CLK_PIN == STM32IO_F1)
#define I2C_CLK_AFIO 1
#endif
#if (I2C_PORT == 1) && (I2C_DATA_PIN == STM32IO_F0)
#define I2C_DATA_AFIO 1
#endif
#if ((I2C_PORT == 1) || (I2C_PORT == 2)) && (I2C_CLK_PIN == STM32IO_F6)
#define I2C_CLK_AFIO 0
#endif
#if ((I2C_PORT == 1) || (I2C_PORT == 2)) && (I2C_DATA_PIN == STM32IO_F7)
#define I2C_DATA_AFIO 0
#endif

#define I2C_IRQ __helper__(I2C, I2C_PORT, _IRQn)
#define I2C_ISR __helper__(I2C, I2C_PORT, _IRQHandler)

#ifndef I2C_FREQ
#define I2C_FREQ 400000UL
#endif
#endif

// Timer registers
#ifndef ITP_TIMER
#define ITP_TIMER 15
#endif
#if (ITP_TIMER == 1)
#define MCU_ITP_ISR TIM1_BRK_UP_TRG_COM_IRQHandler
#define MCU_ITP_IRQ TIM1_BRK_UP_TRG_COM_IRQn
#elif (ITP_TIMER == 6)
#define MCU_ITP_ISR TIM6_DAC_IRQHandler
#define MCU_ITP_IRQ TIM6_DAC_IRQn
#else
#define MCU_ITP_ISR __helper__(TIM, ITP_TIMER, _IRQHandler)
#define MCU_ITP_IRQ __helper__(TIM, ITP_TIMER, _IRQn)
#endif
#define TIMER_REG __helper__(TIM, ITP_TIMER, )
#if (ITP_TIMER == 1 || (ITP_TIMER >= 15 & ITP_TIMER <= 17))
#define TIMER_ENREG APB2ENR
#define TIMER_RESETREG APB2RSTR
#define TIMER_APB __helper__(RCC_APB2ENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define TIMER_ENREG APB1ENR
#define TIMER_RESETREG APB1RSTR
#define TIMER_APB __helper__(RCC_APB1ENR_TIM, ITP_TIMER, EN)
#define TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifndef SERVO_TIMER
#define SERVO_TIMER 16
#endif
#if (SERVO_TIMER == 1)
#define MCU_SERVO_ISR TIM1_BRK_UP_TRG_COM_IRQHandler
#define MCU_SERVO_IRQ TIM1_BRK_UP_TRG_COM_IRQn
#elif (SERVO_TIMER == 6)
#define MCU_SERVO_ISR TIM6_DAC_IRQHandler
#define MCU_SERVO_IRQ TIM6_DAC_IRQn
#else
#define MCU_SERVO_ISR __helper__(TIM, SERVO_TIMER, _IRQHandler)
#define MCU_SERVO_IRQ __helper__(TIM, SERVO_TIMER, _IRQn)
#endif
#define SERVO_TIMER_REG __helper__(TIM, SERVO_TIMER, )
#if (SERVO_TIMER == 1 || (SERVO_TIMER >= 15 & SERVO_TIMER <= 17))
#define SERVO_TIMER_ENREG APB2ENR
#define SERVO_TIMER_RESETREG APB1RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB2ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define SERVO_TIMER_ENREG APB1ENR
#define SERVO_TIMER_RESETREG APB1RSTR
#define SERVO_TIMER_APB __helper__(RCC_APB1ENR_TIM, SERVO_TIMER, EN)
#define SERVO_CLOCK HAL_RCC_GetPCLK1Freq()
#endif

#ifdef ONESHOT_TIMER
#define MCU_HAS_ONESHOT_TIMER
#if (ONESHOT_TIMER == 1)
#define MCU_ONESHOT_ISR TIM1_BRK_UP_TRG_COM_IRQHandler
#define MCU_ONESHOT_IRQ TIM1_BRK_UP_TRG_COM_IRQn
#elif (ONESHOT_TIMER == 6)
#define MCU_ONESHOT_ISR TIM6_DAC_IRQHandler
#define MCU_ONESHOT_IRQ TIM6_DAC_IRQn
#else
#define MCU_ONESHOT_ISR __helper__(TIM, ONESHOT_TIMER, _IRQHandler)
#define MCU_ONESHOT_IRQ __helper__(TIM, ONESHOT_TIMER, _IRQn)
#endif
#define ONESHOT_TIMER_REG __helper__(TIM, ONESHOT_TIMER, )
#if (ONESHOT_TIMER == 1 || (ONESHOT_TIMER >= 15 & ONESHOT_TIMER <= 17))
#define ONESHOT_TIMER_ENREG APB2ENR
#define ONESHOT_TIMER_RESETREG APB1RSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB2ENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#else
#define ONESHOT_TIMER_ENREG APB1ENR
#define ONESHOT_TIMER_RESETREG APB1RSTR
#define ONESHOT_TIMER_APB __helper__(RCC_APB1ENR_TIM, ONESHOT_TIMER, EN)
#define ONESHOT_TIMER_CLOCK HAL_RCC_GetPCLK1Freq()
#endif
#endif

#ifndef __indirect__
#define __indirect__ex__(X, Y) DIO##X##_##Y
#define __indirect__(X, Y) __indirect__ex__(X, Y)
#endif

#ifndef BYTE_OPS
#define BYTE_OPS
// Set bit y in byte x
#define SETBIT(x, y) ((x) |= (1 << (y)))
// Clear bit y in byte x
#define CLEARBIT(x, y) ((x) &= ~(1 << (y)))
// Check bit y in byte x
#define CHECKBIT(x, y) ((x) & (1 << (y)))
// Toggle bit y in byte x
#define TOGGLEBIT(x, y) ((x) ^= (1 << (y)))
// Set byte y in byte x
#define SETFLAG(x, y) ((x) |= (y))
// Clear byte y in byte x
#define CLEARFLAG(x, y) ((x) &= ~(y))
// Check byte y in byte x
#define CHECKFLAG(x, y) ((x) & (y))
// Toggle byte y in byte x
#define TOGGLEFLAG(x, y) ((x) ^= (y))
#endif

#define mcu_config_input(diopin)                                               \
  {                                                                            \
    RCC->AHBENR |= __indirect__(diopin, AHBEN);                                \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT))                           \
                         << 1)); /*reset dir (defaults to input)*/             \
  }

#define mcu_config_output(diopin)                                              \
  {                                                                            \
    RCC->AHBENR |= __indirect__(diopin, AHBEN);                                \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_OUTPUT << ((__indirect__(diopin, BIT)) << 1)); /*output mode*/   \
    __indirect__(diopin, GPIO)->OSPEEDR |=                                     \
        (0x03 << ((__indirect__(diopin, BIT)) << 1)); /*fast speed mode*/      \
  }

#define mcu_config_af(diopin, afrval)                                          \
  {                                                                            \
    RCC->AHBENR |= __indirect__(diopin, AHBEN);                                \
    __indirect__(diopin, GPIO)->MODER &=                                       \
        ~(GPIO_RESET << ((__indirect__(diopin, BIT)) << 1)); /*reset dir*/     \
    __indirect__(diopin, GPIO)->MODER |=                                       \
        (GPIO_AF << ((__indirect__(diopin, BIT)) << 1)); /*af mode*/           \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] &=       \
        ~(0xf << ((__indirect__(diopin, BIT) & 0x07) << 2));                   \
    __indirect__(diopin, GPIO)->AFR[(__indirect__(diopin, BIT) >> 3)] |=       \
        (afrval << ((__indirect__(diopin, BIT) & 0x07) << 2)); /*af mode*/     \
    __indirect__(diopin, GPIO)->OSPEEDR |=                                     \
        (0x03 << ((__indirect__(diopin, BIT)) << 1)); /*fast speed mode*/      \
  }

